
# 定义字典
my_dict = {'王力宏': 99, '周杰伦': 88, '林俊杰': 77 }

# 定义空集合
my_dict2 = {}
my_dict3 = dict()

# 定义重复key的字典
my_dict1 = {'王力宏': 99, '王力宏': 88, '林俊杰': 77 }
print(f"重复key的字典内容是：{my_dict1}")    #后面的重复key覆盖了前面的数据

# 从字典中基于key获取value
my_dict = {'王力宏': 99, '周杰伦': 88, '林俊杰': 77 }
score = my_dict['王力宏']
print(f"王力宏的考试分数是：{score}")


# 字典的key和value可以是任意数据类型（key不可为字典）

# 定义嵌套字典
stu_score_dict = {
    '王力宏': {
        '语文': 77,
        '数学': 66,
        '英语': 33,
    }, '周杰伦': {
        '语文': 88,
        '数学': 86,
        '英语': 55,
    }, '林俊杰': {
        '语文': 99,
        '数学': 96,
        '英语': 66,
    }
}
print(f"学生的考试信息是：{stu_score_dict}")

# 从嵌套字典中获取数据
# 查询周杰伦的语文信息
score = stu_score_dict['周杰伦']['语文']
print(f"周杰伦的语文成绩是：{score}")






